
### :robot: Terraform Report
---
##### Plan: `1` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_alloydb_cluster.default will be updated in-place
  ~ resource "google_alloydb_cluster" "default" {
        id                     = "projects/maestro-intelligence/locations/us-central1/clusters/alloydb-cluster"
        name                   = "projects/maestro-intelligence/locations/us-central1/clusters/alloydb-cluster"
        # (22 unchanged attributes hidden)

      ~ initial_user {
          ~ user     = "testuser" -> "alloydbuser"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # google_secret_manager_secret.alloydb will be created
  + resource "google_secret_manager_secret" "alloydb" {
      + annotations           = {
          + "password" = "YoongeeD7Ai"
          + "username" = "alloydbuser"
        }
      + create_time           = (known after apply)
      + effective_annotations = {
          + "password" = "YoongeeD7Ai"
          + "username" = "alloydbuser"
        }
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
          + "label"                      = "alloydb"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "label" = "alloydb"
        }
      + name                  = (known after apply)
      + project               = "maestro-intelligence"
      + secret_id             = "alloydbsecret"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
          + "label"                      = "alloydb"
        }

      + replication {
          + auto {
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12278693373`](https://github.com/lessthan3/personalization/actions/runs/12278693373) - commit c3455649fd081344e4793c14659dae9d475938c6
